In [1]:
import pandas as pd
import numpy as np

In [2]:
airbnb_price = pd.read_csv('airbnb_price.csv')
airbnb_price.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [3]:
room_type = pd.read_excel('airbnb_room_type.xlsx')
room_type.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [4]:
airbnb_last_review = pd.read_csv('airbnb_last_review.tsv', delimiter = '\t')
airbnb_last_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [9]:
airbnb_last_review.shape

(25209, 3)

In [13]:
merged_df = airbnb_price.merge(room_type, on = 'listing_id')\
            .merge(airbnb_last_review, on = 'listing_id')
print('true')

true

In [14]:
merged_df.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

In [15]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  object
 2   nbhood_full  25209 non-null  object
 3   description  25199 non-null  object
 4   room_type    25209 non-null  object
 5   host_name    25201 non-null  object
 6   last_review  25209 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.3+ MB

In [19]:
merged_df['last_review'] = pd.to_datetime(merged_df['last_review'])
merged_df['last_review'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 25209 entries, 0 to 25208
Series name: last_review
Non-Null Count  Dtype
--------------  -----
25209 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 197.1 KB

### What are the dates of the earliest and most recent reviews? Store these values as two separate variables with your preferred names.

In [23]:
earliest_review = merged_df['last_review'].min()
earliest_review

Timestamp('2019-01-01 00:00:00')

In [24]:
recent_review = merged_df['last_review'].max()
recent_review

Timestamp('2019-07-09 00:00:00')

In [26]:
merged_df.sort_values('last_review', ascending = True)

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
12007,21751907,40 dollars,"Brooklyn, Sunset Park","Room in Brooklyn, 5 min to N and R train",PRIVATE ROOM,Aura Angelica,2019-01-01
10430,19708955,700 dollars,"Manhattan, Tribeca",Good Vibes Tribeca Loft,Entire home/apt,Karen,2019-01-01
14845,25931882,65 dollars,"Brooklyn, Clinton Hill",Large sunny room in Modern Brooklyn Townhouse,Private room,Can,2019-01-01
7203,13936825,75 dollars,"Queens, Forest Hills",Spacious master bedroom in Forest Hills,Private room,Shlomit,2019-01-01
17123,28813184,125 dollars,"Manhattan, East Village",Tranquil East Village 1 Bedroom,Entire home/apt,Carolyn,2019-01-01
...,...,...,...,...,...,...,...
23952,34933891,120 dollars,"Brooklyn, Bedford-Stuyvesant",Beautiful Brooklyn Vintage Townhouse Apartment,Entire home/apt,Jessica,2019-07-08
9595,18331097,100 dollars,"Queens, Flushing",Tidy room separate entrance plus paid parking,Private room,Jimmy &Cindy,2019-07-08
9505,18173787,48 dollars,"Queens, East Elmhurst",Cute Tiny Room Family Home by LGA NO CLEANING FEE,private room,Danielle,2019-07-08
17563,29256134,88 dollars,"Brooklyn, Brooklyn Heights",Brooklyn Heights contemporary studio apartment,Entire home/apt,Scott,2019-07-08
58,18152,200 dollars,"Manhattan, Upper East Side",Manhattan Room,Private room,Victoria,2019-07-09

### How many of the listings are private rooms? Save this into any variable.

In [27]:
merged_df['room_type'].value_counts()

room_type
Entire home/apt    8458
Private room       7241
entire home/apt    2665
private room       2248
ENTIRE HOME/APT    2143
PRIVATE ROOM       1867
Shared room         380
shared room         110
SHARED ROOM          97
Name: count, dtype: int64

In [40]:
merged_df['room_type'] = merged_df['room_type'].str.lower()
merged_df['room_type'].value_counts()

room_type
entire home/apt    13266
private room       11356
shared room          587
Name: count, dtype: int64

In [46]:
num_priv_rooms = merged_df[merged_df['room_type'] == 'private room'].shape[0]
num_priv_rooms

11356

### What is the average listing price? Round to the nearest two decimal places and save into a variable.

In [56]:
merged_df['price'] = merged_df['price'].str.replace('dollars', '')
merged_df['price'] =merged_df['price'].astype('int')

In [58]:
merged_df['price'].describe()

count    25209.000000
mean       141.777936
std        147.349137
min          0.000000
25%         69.000000
50%        105.000000
75%        175.000000
max       7500.000000
Name: price, dtype: float64

In [60]:
avg_price = merged_df['price'].mean()
rounded_avg_price = round(avg_price, 2)
rounded_avg_price

141.78

### Combine the new variables into one DataFrame called review_dates with four columns in the following order: first_reviewed, last_reviewed, nb_private_rooms, and avg_price. The DataFrame should only contain one row of values.

In [64]:
review_dates = pd.DataFrame({
    'first_reviewed': [earliest_review],
    'last_reviewed': [recent_review],
    'nb_private_rooms': [num_priv_rooms],
    'avg_price': [rounded_avg_price]
})
review_dates

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78